intro.org
#+TITLE:     Introducción a R
#+AUTHOR:    Oscar Perpiñán Lamigueiro
#+EMAIL:     oscar.perpinan@gmail.com
#+DATE:      Febrero de 2013
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  es
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+startup: beamer
#+LaTeX_CLASS: beamer
#+BEAMER_FRAME_LEVEL: 3
#+LATEX_CLASS_OPTIONS: [xcolor={usenames,svgnames,dvipsnames}]
#+LATEX_HEADER: \AtBeginSection[]{\begin{frame}[plain]\tableofcontents[currentsection,hideallsubsections]\end{frame}}
#+LATEX_HEADER: \lstset{keywordstyle=\color{blue}, commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {º}{{\textordmasculine}}1}
#+LATEX_HEADER: \usepackage{mathpazo}
#+LATEX_HEADER: \usefonttheme{serif}
#+LATEX_HEADER: \usecolortheme{rose}  
#+LATEX_HEADER: \usetheme{Goettingen}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=Blue, urlcolor=Blue}
#+PROPERTY:  tangle yes
#+PROPERTY:  comments org

* R es software libre
** ¿Qué es =R=?
*** ¿Qué es =R=?						    
**** ¿Qué es [[http://procomun.wordpress.com/2011/02/23/que-es-r/][R]]?			    :B_block:
     :PROPERTIES:
     :BEAMER_env: block
     :END:
Es un lenguaje de programación principalmente orientado al
análisis estadístico y visualización de información cuantitativa y
cualitativa y publicado como software libre con licencia GNU-GPL.
#+BEGIN_CENTER
 [[http://www.R-project.org]] 
#+END_CENTER

*** Para instalar =R=

- Windows: http://cran.es.r-project.org/bin/windows/base/
- Mac: http://cran.es.r-project.org/bin/macosx/
- Linux: http://cran.es.r-project.org/bin/linux/

*** Interfaces para R

- En mi opinión, la mejor interfaz para R es [[http://ess.r-project.org/][ESS]] con [[http://www.gnu.org/software/emacs/][Emacs]]. 
- Para los que prefieren una interfaz gráfica es recomendable [[http://www.rstudio.com/ide/][RStudio]]:
  - Instalador: http://www.rstudio.com/ide/download/desktop
  - Introducción: http://www.rstudio.com/ide/docs/using/source

** R es un proyecto colaborativo
*** R es un proyecto colaborativo
- Una de las grandes riquezas de R es la cantidad de paquetes (más
  de 4000 actualmente) que amplían sus funcionalidades.  
- La lista completa está en http://cran.es.r-project.org/web/packages/.
- Las CRAN Task Views agrupan por temáticas:
  [[http://cran.r-project.org/web/views/]]

*** Más de 4000 paquetes disponibles
- Algunos vienen instalados y se cargan al empezar:
#+begin_src R 
  sessionInfo()
#+end_src
- Otros vienen instalados pero hay que cargarlos:
#+begin_src R 
  library(lattice)
  packageVersion('lattice')
  packageDescription('lattice')
#+end_src
- Otros hay que instalarlos y después cargarlos:
#+begin_src R 
  install.packages('zoo')
  library('zoo')
  packageDescription('zoo')
#+end_src

** R está muy bien documentado

*** Fuentes de información
- [[http://cran.r-project.org/doc/manuals/R-intro.html][Manual introductorio]]
- [[http://cran.r-project.org/manuals.html][Manuales oficiales]]
- [[http://cran.r-project.org/other-docs.html][Manuales externos]]
- [[http://www.r-project.org/mail.html][Listas de correo]] (sin olvidar respetar [[http://www.r-project.org/posting-guide.html][estos consejos]]).
- [[http://www.r-bloggers.com][R-bloggers]]


* Vectores y Matrices

** Vectores 
*** Primeros pasos
#+begin_src R 
x <- 1
x
length(x)
class(x)

x <- c(1, 2, 3)
x
length(x)
class(x)
#+end_src

*** Primeras funciones
#+begin_src R 
class(c)
class(length)
length
#+end_src

*** Operaciones sencillas con vectores
#+begin_src R 
  x + 1
  y <- 1:10
  x + y
  x * y
  x^2
  x^2 + y^3
  exp(x)
  log(x)
#+end_src

*** ¿Y qué hago cuando necesito ayuda?

#+begin_src R 
help(exp)
help(log)
#+end_src

*** Generar vectores con =seq=
#+begin_src R 
x1 <- seq(1, 100, by=2)
x1
help(seq)

seq(1, 100, 10)
seq(1, 100, length=10)
seq(1, 1, 10)

x <- seq(1, 100, length=10)
x
length(x)

x <- seq(1, 100, length=10)
y <- seq(2, 100, length=50)
#+end_src

*** Unir vectores con =c=
#+begin_src R 
z <- c(x, y)
z
z + c(1, 2)
z + c(1, 2, 3, 4, 5, 6, 7)
z <- c(z, z, z, z)
z
#+end_src

*** Generar vectores con =rep=
#+begin_src R 
rep(1:10, 4)

length(z)

rep(c(1, 2, 3), 10)
rep(c(1, 2, 3), each=10)
help(rep)
#+end_src


*** Indexado numérico de vectores

#+begin_src R 
  x <- seq(1, 100, 2)
  1:5
  x[c(1, 2, 3, 4, 5)]
  x[1:5]
  x[10:5]
#+end_src

*** Indexado de vectores con condiciones lógicas
#+begin_src R 
  condicion <- (x>30)
  condicion
  class(condicion)
#+end_src

*** Indexado de vectores con condiciones lógicas

#+begin_src R 
  x==37
  x[x==37]
  x[x!=9]
  x[x>20]
#+end_src

- Y aquí ¿qué ocurre?
#+begin_src R 
  x[x=10]
#+end_src
     
*** Indexado de vectores con =%in%=
#+begin_src R 
y <- seq(101, 200, 2)
y %in% c(101, 127, 141)
y
y[y %in% c(101, 127, 141)]
#+end_src

*** Indexado de vectores con condiciones múltiples

#+begin_src R 
z <- c(x, y)
z
z>150
z[z>150]
z[z<30 | z>150]
z[z>=30 & z<=150]
z[c(1, 10, 40, 80)]
#+end_src

*** Indexado de vectores con condiciones múltiples
#+begin_src R 
cond  <-  (x>10) & (x<50)
cond
cond  <-  (x>=10) & (x<=50)
cond
x[cond]

#+end_src

*** Con las condiciones se pueden hacer operaciones
#+begin_src R 
sum(cond)
!cond
sum(!cond)
length(x[cond])
length(x[!cond])
as.numeric(cond)
#+end_src
    

*** Funciones predefinidas
#+begin_src R 
summary(x)
mean(x)
sd(x)
median(x)
max(x)
min(x)
range(x)
quantile(x)
#+end_src



** Matrices
*** Construir una matriz
#+begin_src R 
  z <- 1:12
  M  <-  matrix(z, nrow=3)
  M
  z
  help(matrix)
  class(M)
  dim(M)
  summary(M)
#+end_src

*** Matrices a partir de vectores: =rbind= y =cbind=
#+begin_src R 
x <- 1:10
y <- 1:10
z <- 1:10
z <- y <- x <- 1:10

M <- cbind(x, y, z)
M
M <- rbind(x, y, z)
M

rbind(M, M)
cbind(M, M)
#+end_src

*** Transponer una matriz

#+begin_src R 
t(M)
class(t)
dim(t(M))
#+end_src

*** Operaciones con matrices

#+begin_src R 
M * M
M ^ 2
M %*% M
M %*% t(M)
help('%*%')
#+end_src

*** Operaciones con matrices: funciones predefinidas

#+begin_src R 
sum(M)
rowSums(M)
colSums(M)
rowMeans(M)
colMeans(M)
#+end_src

