intro.tex
% Created 2013-03-05 mar 22:27
\documentclass[xcolor={usenames,svgnames,dvipsnames}]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{color}
\usepackage{listings}
\AtBeginSection[]{\begin{frame}[plain]\tableofcontents[currentsection,hideallsubsections]\end{frame}}
\lstset{keywordstyle=\color{blue}, commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {º}{{\textordmasculine}}1}
\usepackage{mathpazo}
\usefonttheme{serif}
\usecolortheme{rose}  
\usetheme{Goettingen}
\hypersetup{colorlinks=true, linkcolor=Blue, urlcolor=Blue}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Introducción a R}
\author{Oscar Perpiñán Lamigueiro}
\date{Febrero de 2013}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

\begin{document}

\maketitle


\section{R es software libre}
\label{sec-1}
\subsection{¿Qué es \texttt{R}?}
\label{sec-1-1}
\begin{frame}
\frametitle{¿Qué es \texttt{R}?}
\label{sec-1-1-1}
\begin{block}{¿Qué es \href{http://procomun.wordpress.com/2011/02/23/que-es-r/}{R}?}
\label{sec-1-1-1-1}

Es un lenguaje de programación principalmente orientado al
análisis estadístico y visualización de información cuantitativa y
cualitativa y publicado como software libre con licencia GNU-GPL.
\begin{center}
\href{http://www.R-project.org}{http://www.R-project.org} 
\end{center}
\end{block}
\end{frame}
\begin{frame}
\frametitle{Para instalar \texttt{R}}
\label{sec-1-1-2}


\begin{itemize}
\item Windows: \href{http://cran.es.r-project.org/bin/windows/base/}{http://cran.es.r-project.org/bin/windows/base/}
\item Mac: \href{http://cran.es.r-project.org/bin/macosx/}{http://cran.es.r-project.org/bin/macosx/}
\item Linux: \href{http://cran.es.r-project.org/bin/linux/}{http://cran.es.r-project.org/bin/linux/}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Interfaces para R}
\label{sec-1-1-3}


\begin{itemize}
\item En mi opinión, la mejor interfaz para R es \href{http://ess.r-project.org/}{ESS} con \href{http://www.gnu.org/software/emacs/}{Emacs}.
\item Para los que prefieren una interfaz gráfica es recomendable \href{http://www.rstudio.com/ide/}{RStudio}:
\begin{itemize}
\item Instalador: \href{http://www.rstudio.com/ide/download/desktop}{http://www.rstudio.com/ide/download/desktop}
\item Introducción: \href{http://www.rstudio.com/ide/docs/using/source}{http://www.rstudio.com/ide/docs/using/source}
\end{itemize}
\end{itemize}
\end{frame}
\subsection{R es un proyecto colaborativo}
\label{sec-1-2}
\begin{frame}
\frametitle{R es un proyecto colaborativo}
\label{sec-1-2-1}

\begin{itemize}
\item Una de las grandes riquezas de R es la cantidad de paquetes (más
  de 4000 actualmente) que amplían sus funcionalidades.
\item La lista completa está en \href{http://cran.es.r-project.org/web/packages/}{http://cran.es.r-project.org/web/packages/}.
\item Las CRAN Task Views agrupan por temáticas:
  \href{http://cran.r-project.org/web/views/}{http://cran.r-project.org/web/views/}
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Más de 4000 paquetes disponibles}
\label{sec-1-2-2}

\begin{itemize}
\item Algunos vienen instalados y se cargan al empezar:
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
sessionInfo()
\end{lstlisting}
\begin{itemize}
\item Otros vienen instalados pero hay que cargarlos:
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
library(lattice)
packageVersion('lattice')
packageDescription('lattice')
\end{lstlisting}
\begin{itemize}
\item Otros hay que instalarlos y después cargarlos:
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
install.packages('zoo')
library('zoo')
packageDescription('zoo')
\end{lstlisting}
\end{frame}
\subsection{R está muy bien documentado}
\label{sec-1-3}
\begin{frame}
\frametitle{Fuentes de información}
\label{sec-1-3-1}

\begin{itemize}
\item \href{http://cran.r-project.org/doc/manuals/R-intro.html}{Manual introductorio}
\item \href{http://cran.r-project.org/manuals.html}{Manuales oficiales}
\item \href{http://cran.r-project.org/other-docs.html}{Manuales externos}
\item \href{http://www.r-project.org/mail.html}{Listas de correo} (sin olvidar respetar \href{http://www.r-project.org/posting-guide.html}{estos consejos}).
\item \href{http://www.r-bloggers.com}{R-bloggers}
\end{itemize}
\end{frame}
\section{Vectores y Matrices}
\label{sec-2}
\subsection{Vectores}
\label{sec-2-1}
\begin{frame}[fragile]
\frametitle{Primeros pasos}
\label{sec-2-1-1}


\lstset{language=R}
\begin{lstlisting}
x <- 1
x
length(x)
class(x)

x <- c(1, 2, 3)
x
length(x)
class(x)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Primeras funciones}
\label{sec-2-1-2}


\lstset{language=R}
\begin{lstlisting}
class(c)
class(length)
length
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Operaciones sencillas con vectores}
\label{sec-2-1-3}


\lstset{language=R}
\begin{lstlisting}
x + 1
y <- 1:10
x + y
x * y
x^2
x^2 + y^3
exp(x)
log(x)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{¿Y qué hago cuando necesito ayuda?}
\label{sec-2-1-4}



\lstset{language=R}
\begin{lstlisting}
help(exp)
help(log)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Generar vectores con \texttt{seq}}
\label{sec-2-1-5}


\lstset{language=R}
\begin{lstlisting}
x1 <- seq(1, 100, by=2)
x1
help(seq)

seq(1, 100, 10)
seq(1, 100, length=10)
seq(1, 1, 10)

x <- seq(1, 100, length=10)
x
length(x)

x <- seq(1, 100, length=10)
y <- seq(2, 100, length=50)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Unir vectores con \texttt{c}}
\label{sec-2-1-6}


\lstset{language=R}
\begin{lstlisting}
z <- c(x, y)
z
z + c(1, 2)
z + c(1, 2, 3, 4, 5, 6, 7)
z <- c(z, z, z, z)
z
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Generar vectores con \texttt{rep}}
\label{sec-2-1-7}


\lstset{language=R}
\begin{lstlisting}
rep(1:10, 4)

length(z)

rep(c(1, 2, 3), 10)
rep(c(1, 2, 3), each=10)
help(rep)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Indexado numérico de vectores}
\label{sec-2-1-8}



\lstset{language=R}
\begin{lstlisting}
x <- seq(1, 100, 2)
1:5
x[c(1, 2, 3, 4, 5)]
x[1:5]
x[10:5]
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Indexado de vectores con condiciones lógicas}
\label{sec-2-1-9}


\lstset{language=R}
\begin{lstlisting}
condicion <- (x>30)
condicion
class(condicion)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Indexado de vectores con condiciones lógicas}
\label{sec-2-1-10}



\lstset{language=R}
\begin{lstlisting}
x==37
x[x==37]
x[x!=9]
x[x>20]
\end{lstlisting}

\begin{itemize}
\item Y aquí ¿qué ocurre?
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
x[x=10]
\end{lstlisting}
     
\end{frame}
\begin{frame}[fragile]
\frametitle{Indexado de vectores con \texttt{\%in\%}}
\label{sec-2-1-11}


\lstset{language=R}
\begin{lstlisting}
y <- seq(101, 200, 2)
y %in% c(101, 127, 141)
y
y[y %in% c(101, 127, 141)]
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Indexado de vectores con condiciones múltiples}
\label{sec-2-1-12}



\lstset{language=R}
\begin{lstlisting}
z <- c(x, y)
z
z>150
z[z>150]
z[z<30 | z>150]
z[z>=30 & z<=150]
z[c(1, 10, 40, 80)]
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Indexado de vectores con condiciones múltiples}
\label{sec-2-1-13}


\lstset{language=R}
\begin{lstlisting}
cond  <-  (x>10) & (x<50)
cond
cond  <-  (x>=10) & (x<=50)
cond
x[cond]
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Con las condiciones se pueden hacer operaciones}
\label{sec-2-1-14}


\lstset{language=R}
\begin{lstlisting}
sum(cond)
!cond
sum(!cond)
length(x[cond])
length(x[!cond])
as.numeric(cond)
\end{lstlisting}
    
\end{frame}
\begin{frame}[fragile]
\frametitle{Funciones predefinidas}
\label{sec-2-1-15}


\lstset{language=R}
\begin{lstlisting}
summary(x)
mean(x)
sd(x)
median(x)
max(x)
min(x)
range(x)
quantile(x)
\end{lstlisting}
\end{frame}
\subsection{Matrices}
\label{sec-2-2}
\begin{frame}[fragile]
\frametitle{Construir una matriz}
\label{sec-2-2-1}


\lstset{language=R}
\begin{lstlisting}
z <- 1:12
M  <-  matrix(z, nrow=3)
M
z
help(matrix)
class(M)
dim(M)
summary(M)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Matrices a partir de vectores: \texttt{rbind} y \texttt{cbind}}
\label{sec-2-2-2}


\lstset{language=R}
\begin{lstlisting}
x <- 1:10
y <- 1:10
z <- 1:10
z <- y <- x <- 1:10

M <- cbind(x, y, z)
M
M <- rbind(x, y, z)
M

rbind(M, M)
cbind(M, M)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Transponer una matriz}
\label{sec-2-2-3}



\lstset{language=R}
\begin{lstlisting}
t(M)
class(t)
dim(t(M))
\end{lstlisting}
\end{frame}
