intro.org
*** La función =apply=
#+begin_src R 
help(apply)
apply(M, 1, sum)
apply(M, 2, sum)
apply(M, 1, mean)
apply(M, 2, mean)
apply(M, 1, sd, na.rm=TRUE)
apply(M, 2, sd)
#+end_src

*** =sweep=
- Usamos el conjunto de datos =state.x77=
#+begin_src R 
  head(state.x77)  
#+end_src
- Calculamos el máximo por columna
#+begin_src R 
maxes <- apply(state.x77, 2, max)
#+end_src
- Dividimos cada columna por su máximo
#+begin_src R 
  stateNorm <- sweep(state.x77, 2, maxes, FUN="/")
  head(stateNorm)
#+end_src

*** Indexado de matrices
#+begin_src R 
M
M[]
M[1, ]
M[, 1]
sum(M[, 1])
M[1:2, ]
M[1:2, 2:3]
M[1, c(1, 4)]
M[-1,]
M[-c(1, 2),]
#+end_src
    

** Valores ausentes
   
*** ¿Qué es =NA=?
#+begin_src R 
  class(NA)
  x <- rnorm(100)
  idx <- sample(length(x), 10)
  idx
  x[idx]
  x2 <- x
  x2[idx] <- NA
  x2
#+end_src

*** =NA= en las funciones

#+begin_src R 
  summary(x)
  mean(x)
  sum(x)
  
  summary(x2)
  mean(x2)
  sum(x2)
#+end_src

*** =NA= en las funciones

#+begin_src R 
mean(x2, na.rm=TRUE)
sum(x2, na.rm=TRUE)
sd(x2, na.rm=TRUE)
class(TRUE)
#+end_src


* Funciones

** Definición de funciones
*** Para definir una función usamos la función =function=
#+begin_src R 
  myFun <- function(x, y) x + y
  myFun(3, 4)
  class(myFun)
#+end_src

*** Definir una función a partir de funciones
#+begin_src R 
foo  <-  function(x, ...){
  mx <- mean(x, ...)
  medx <- median(x, ...)
  sdx <- sd(x, ...)
  c(mx, medx, sdx)
  }
#+end_src
O en forma resumida:
#+begin_src R 
foo <- function(x, ...){c(mean(x, ...), median(x, ...), sd(x, ...))}
#+end_src


** Uso de funciones
*** Y ahora usamos la función con vectores
#+begin_src R 
foo(1:10)

rnorm(100)
help(rnorm)
foo(rnorm(1e5))
#+end_src

*** Y también funciona con matrices
#+begin_src R 
rowMeans(M)
apply(M, 1, foo)
colMeans(M)
apply(M, 2, foo)
#+end_src

*** La función =outer=
#+begin_src R 
f <- function(x, y)x^2+y^2
f
f(1, 2)
x
y

z <- outer(x, y, f)
z
image(x, y, z)
#+end_src


* Listas y data.frame

** Listas
*** Para crear una lista usamos la función =list=
#+begin_src R 
  lista <- list(a=c(1,3,5),
                b=c('l', 'p', 'r', 's'),
                c=3)
  class(list)
  class(lista)
#+end_src

*** Podemos acceder a los elementos...
- Por su nombre
#+begin_src R 
lista
lista$a
lista$b
lista$c
#+end_src

- o por su índice
#+begin_src R 
  lista[1]
  lista[[1]]
  
  class(lista[1])
  class(lista[[1]])
  
  lista[2]
  lista[[2]]
  
  class(lista[2])
  class(lista[[2]])
#+end_src

*** Cada elemento es diferente
- Clase
#+begin_src R 
class(lista)
class(lista$a)
class(lista$b)
class(lista$c)
#+end_src
- Longitud
#+begin_src R 
length(lista)
length(lista$a)
length(lista$b)
length(lista$c)
#+end_src

*** Para matrices =apply=, para listas =lapply= y =sapply=
#+begin_src R 
lapply(lista, length)
sapply(lista, length)

lista <- list(x = 1:10,
              y = seq(0, 10, 2),
              z = rnorm(30))
lista

lapply(lista, sum)
lapply(lista, median)
lapply(lista, foo)
#+end_src


** Data.frame
*** Para crear un =data.frame=...
#+begin_src R 
  df <- data.frame(x = 1:10,
                   y = rnorm(10),
                   z = 0)
  
  length(df)
  dim(df)
#+end_src
*** Podemos acceder a los elementos
- Por su nombre
#+begin_src R 
df$x
df$y
df$z
#+end_src

- Por su índice
#+begin_src R 
df
df[1,]
df[,1]
df[,2]
#+end_src

*** La regla del reciclaje
#+begin_src R 
  year <- 2011
  month <- 1:12
  class <- c('A', 'B', 'C')
  vals <- rnorm(12)
  
  dats <- data.frame(year, month, class, vals)
  dats
#+end_src
*** La función =expand.grid=

#+begin_src R 
  x <- y <- seq(-4*pi, 4*pi, len=200)
  df <- expand.grid(x = x, y = y)
  head(df)
  tail(df)
  summary(df)
  dim(df)
  names(df)
#+end_src

*** Funciones sobre =data.frame=

#+begin_src R 
  circles <- function(object){
    r <- with(object, sqrt(x^2 + y^2))
    res <- cos(r^2)*exp(-r/6)
    res}
  
  df$result <- circles(df)
  head(df)
#+end_src

*** Una imagen vale más que mil palabras
#+begin_src R 
  library(lattice)
  levelplot(result ~ x + y, data=df)
#+end_src

*** Unir dos =data.frame=
- Primero construimos un =data.frame= de ejemplo
#+begin_src R 
  USStates <- as.data.frame(state.x77)
  USStates$Name <- rownames(USStates)
  rownames(USStates) <- NULL
#+end_src
- Lo partimos en estados "fríos" y estados "grandes"
#+begin_src R 
  coldStates <- USStates[USStates$Frost>150, c('Name', 'Frost')]
  largeStates <- USStates[USStates$Area>1e5, c('Name', 'Area')]
#+end_src
- Unimos los dos conjuntos (estados "fríos" y "grandes")
#+begin_src R 
  merge(coldStates, largeStates)
#+end_src

*** =merge= usa =match=
- Estados grandes que también son fríos
#+begin_src R 
  idxLarge <- match(largeStates$Name,
                    coldStates$Name,
                    nomatch=0)
  idxLarge
  
  largeStates[idxLarge,]
#+end_src

- Estados frios que también son grandes
#+begin_src R 
  idxCold <- match(coldStates$Name,
                   largeStates$Name,
                   nomatch=0)
  idxCold
  
  coldStates[idxCold,]
#+end_src

* Factores, fechas y caracteres
** =factor= 
*** Una variable numérica que nos servirá para el ejemplo
#+begin_src R 
  N <- 100
  edad <- sample(seq(18, 40, 1), N, replace=TRUE)
  summary(edad)
#+end_src

*** Una variable cualitativa se define con =factor=
- Ahora es un =character=
#+begin_src R 
  sexo <- sample(c('H', 'M'), N, replace=TRUE)
  class(sexo)
  summary(sexo)
#+end_src  
- Ahora es un =factor=
#+begin_src R 
  sexo <- factor(sexo)
  class(sexo)
  summary(sexo)
  levels(sexo)
  nlevels(sexo)
#+end_src

*** Los =factor= sirven para agrupar

- Con la función =table=
#+begin_src R 
  table(edad, sexo)
  table(edad > 30, sexo)
  table(edad %in% 20:30, sexo)
#+end_src

- Con =tapply= o =aggregate=
#+begin_src R 
tapply(edad,sexo, mean)
aggregate(edad ~ sexo, FUN=median)
#+end_src

*** Los factores sirven para separar
#+begin_src R 
  edadSexo <- split(edad, sexo)
  class(edadSexo)
  
  sapply(edadSexo, mean)
#+end_src

