intro.tex
\begin{frame}[fragile]
\frametitle{Operaciones con matrices}
\label{sec-2-2-4}



\lstset{language=R}
\begin{lstlisting}
M * M
M ^ 2
M %*% M
M %*% t(M)
help('%*%')
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Operaciones con matrices: funciones predefinidas}
\label{sec-2-2-5}



\lstset{language=R}
\begin{lstlisting}
sum(M)
rowSums(M)
colSums(M)
rowMeans(M)
colMeans(M)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{La función \texttt{apply}}
\label{sec-2-2-6}


\lstset{language=R}
\begin{lstlisting}
help(apply)
apply(M, 1, sum)
apply(M, 2, sum)
apply(M, 1, mean)
apply(M, 2, mean)
apply(M, 1, sd, na.rm=TRUE)
apply(M, 2, sd)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{\texttt{sweep}}
\label{sec-2-2-7}

\begin{itemize}
\item Usamos el conjunto de datos \texttt{state.x77}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
head(state.x77)
\end{lstlisting}
\begin{itemize}
\item Calculamos el máximo por columna
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
maxes <- apply(state.x77, 2, max)
\end{lstlisting}
\begin{itemize}
\item Dividimos cada columna por su máximo
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
stateNorm <- sweep(state.x77, 2, maxes, FUN="/")
head(stateNorm)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Indexado de matrices}
\label{sec-2-2-8}


\lstset{language=R}
\begin{lstlisting}
M
M[]
M[1, ]
M[, 1]
sum(M[, 1])
M[1:2, ]
M[1:2, 2:3]
M[1, c(1, 4)]
M[-1,]
M[-c(1, 2),]
\end{lstlisting}
    
\end{frame}
\subsection{Valores ausentes}
\label{sec-2-3}

   
\begin{frame}[fragile]
\frametitle{¿Qué es \texttt{NA}?}
\label{sec-2-3-1}


\lstset{language=R}
\begin{lstlisting}
class(NA)
x <- rnorm(100)
idx <- sample(length(x), 10)
idx
x[idx]
x2 <- x
x2[idx] <- NA
x2
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{\texttt{NA} en las funciones}
\label{sec-2-3-2}



\lstset{language=R}
\begin{lstlisting}
summary(x)
mean(x)
sum(x)

summary(x2)
mean(x2)
sum(x2)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{\texttt{NA} en las funciones}
\label{sec-2-3-3}



\lstset{language=R}
\begin{lstlisting}
mean(x2, na.rm=TRUE)
sum(x2, na.rm=TRUE)
sd(x2, na.rm=TRUE)
class(TRUE)
\end{lstlisting}
\end{frame}
\section{Funciones}
\label{sec-3}
\subsection{Definición de funciones}
\label{sec-3-1}
\begin{frame}[fragile]
\frametitle{Para definir una función usamos la función \texttt{function}}
\label{sec-3-1-1}


\lstset{language=R}
\begin{lstlisting}
myFun <- function(x, y) x + y
myFun(3, 4)
class(myFun)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Definir una función a partir de funciones}
\label{sec-3-1-2}


\lstset{language=R}
\begin{lstlisting}
foo  <-  function(x, ...){
  mx <- mean(x, ...)
  medx <- median(x, ...)
  sdx <- sd(x, ...)
  c(mx, medx, sdx)
  }
\end{lstlisting}
O en forma resumida:

\lstset{language=R}
\begin{lstlisting}
foo <- function(x, ...){c(mean(x, ...), median(x, ...), sd(x, ...))}
\end{lstlisting}
\end{frame}
\subsection{Uso de funciones}
\label{sec-3-2}
\begin{frame}[fragile]
\frametitle{Y ahora usamos la función con vectores}
\label{sec-3-2-1}


\lstset{language=R}
\begin{lstlisting}
foo(1:10)

rnorm(100)
help(rnorm)
foo(rnorm(1e5))
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Y también funciona con matrices}
\label{sec-3-2-2}


\lstset{language=R}
\begin{lstlisting}
rowMeans(M)
apply(M, 1, foo)
colMeans(M)
apply(M, 2, foo)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{La función \texttt{outer}}
\label{sec-3-2-3}


\lstset{language=R}
\begin{lstlisting}
f <- function(x, y)x^2+y^2
f
f(1, 2)
x
y

z <- outer(x, y, f)
z
image(x, y, z)
\end{lstlisting}
\end{frame}
\section{Listas y data.frame}
\label{sec-4}
\subsection{Listas}
\label{sec-4-1}
\begin{frame}[fragile]
\frametitle{Para crear una lista usamos la función \texttt{list}}
\label{sec-4-1-1}


\lstset{language=R}
\begin{lstlisting}
lista <- list(a=c(1,3,5),
              b=c('l', 'p', 'r', 's'),
              c=3)
class(list)
class(lista)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Podemos acceder a los elementos\ldots{}}
\label{sec-4-1-2}

\begin{itemize}
\item Por su nombre
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
lista
lista$a
lista$b
lista$c
\end{lstlisting}

\begin{itemize}
\item o por su índice
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
lista[1]
lista[[1]]

class(lista[1])
class(lista[[1]])

lista[2]
lista[[2]]

class(lista[2])
class(lista[[2]])
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Cada elemento es diferente}
\label{sec-4-1-3}

\begin{itemize}
\item Clase
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
class(lista)
class(lista$a)
class(lista$b)
class(lista$c)
\end{lstlisting}
\begin{itemize}
\item Longitud
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
length(lista)
length(lista$a)
length(lista$b)
length(lista$c)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Para matrices \texttt{apply}, para listas \texttt{lapply} y \texttt{sapply}}
\label{sec-4-1-4}


\lstset{language=R}
\begin{lstlisting}
lapply(lista, length)
sapply(lista, length)

lista <- list(x = 1:10,
              y = seq(0, 10, 2),
              z = rnorm(30))
lista

lapply(lista, sum)
lapply(lista, median)
lapply(lista, foo)
\end{lstlisting}
\end{frame}
\subsection{Data.frame}
\label{sec-4-2}
\begin{frame}[fragile]
\frametitle{Para crear un \texttt{data.frame}...}
\label{sec-4-2-1}


\lstset{language=R}
\begin{lstlisting}
df <- data.frame(x = 1:10,
                 y = rnorm(10),
                 z = 0)

length(df)
dim(df)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Podemos acceder a los elementos}
\label{sec-4-2-2}

\begin{itemize}
\item Por su nombre
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
df$x
df$y
df$z
\end{lstlisting}

\begin{itemize}
\item Por su índice
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
df
df[1,]
df[,1]
df[,2]
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{La regla del reciclaje}
\label{sec-4-2-3}


\lstset{language=R}
\begin{lstlisting}
year <- 2011
month <- 1:12
class <- c('A', 'B', 'C')
vals <- rnorm(12)

dats <- data.frame(year, month, class, vals)
dats
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{La función \texttt{expand.grid}}
\label{sec-4-2-4}



\lstset{language=R}
\begin{lstlisting}
x <- y <- seq(-4*pi, 4*pi, len=200)
df <- expand.grid(x = x, y = y)
head(df)
tail(df)
summary(df)
dim(df)
names(df)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Funciones sobre \texttt{data.frame}}
\label{sec-4-2-5}



\lstset{language=R}
\begin{lstlisting}
circles <- function(object){
  r <- with(object, sqrt(x^2 + y^2))
  res <- cos(r^2)*exp(-r/6)
  res}

df$result <- circles(df)
head(df)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Una imagen vale más que mil palabras}
\label{sec-4-2-6}


\lstset{language=R}
\begin{lstlisting}
library(lattice)
levelplot(result ~ x + y, data=df)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Unir dos \texttt{data.frame}}
\label{sec-4-2-7}

\begin{itemize}
\item Primero construimos un \texttt{data.frame} de ejemplo
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
USStates <- as.data.frame(state.x77)
USStates$Name <- rownames(USStates)
rownames(USStates) <- NULL
\end{lstlisting}
\begin{itemize}
\item Lo partimos en estados ``fríos'' y estados ``grandes''
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
coldStates <- USStates[USStates$Frost>150, c('Name', 'Frost')]
largeStates <- USStates[USStates$Area>1e5, c('Name', 'Area')]
\end{lstlisting}
\begin{itemize}
\item Unimos los dos conjuntos (estados ``fríos'' y ``grandes'')
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
merge(coldStates, largeStates)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{\texttt{merge} usa \texttt{match}}
\label{sec-4-2-8}

\begin{itemize}
\item Estados grandes que también son fríos
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
idxLarge <- match(largeStates$Name,
                  coldStates$Name,
                  nomatch=0)
idxLarge

largeStates[idxLarge,]
\end{lstlisting}

\begin{itemize}
\item Estados frios que también son grandes
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
idxCold <- match(coldStates$Name,
                 largeStates$Name,
                 nomatch=0)
idxCold

coldStates[idxCold,]
\end{lstlisting}
\end{frame}
\section{Factores, fechas y caracteres}
\label{sec-5}
\subsection{\texttt{factor}}
\label{sec-5-1}
\begin{frame}[fragile]
\frametitle{Una variable numérica que nos servirá para el ejemplo}
\label{sec-5-1-1}


\lstset{language=R}
\begin{lstlisting}
N <- 100
edad <- sample(seq(18, 40, 1), N, replace=TRUE)
summary(edad)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Una variable cualitativa se define con \texttt{factor}}
\label{sec-5-1-2}

\begin{itemize}
\item Ahora es un \texttt{character}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
sexo <- sample(c('H', 'M'), N, replace=TRUE)
class(sexo)
summary(sexo)
\end{lstlisting}
\begin{itemize}
\item Ahora es un \texttt{factor}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
sexo <- factor(sexo)
class(sexo)
summary(sexo)
levels(sexo)
nlevels(sexo)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Los \texttt{factor} sirven para agrupar}
\label{sec-5-1-3}


\begin{itemize}
\item Con la función \texttt{table}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
table(edad, sexo)
table(edad > 30, sexo)
table(edad %in% 20:30, sexo)
\end{lstlisting}

\begin{itemize}
\item Con \texttt{tapply} o \texttt{aggregate}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
tapply(edad,sexo, mean)
aggregate(edad ~ sexo, FUN=median)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Los factores sirven para separar}
\label{sec-5-1-4}


\lstset{language=R}
\begin{lstlisting}
edadSexo <- split(edad, sexo)
class(edadSexo)

sapply(edadSexo, mean)
\end{lstlisting}
\end{frame}
