intro.org
*** Los =factor= se pueden generar a partir de variables numéricas
- Por ejemplo, con =cut=
#+begin_src R 
  gEdad <- cut(edad, breaks=4)
  class(gEdad)
  levels(gEdad)
  nlevels(gEdad)
#+end_src

- Nuevamente =table=
#+begin_src R 
  table(gEdad)
  table(gEdad, sexo)
#+end_src

** Fechas

*** =Date=
#+begin_src R 
  as.Date('2013-02-06')
  as.Date('2013/02/06')
  
  as.Date('06.02.2013')
  as.Date('06.02.2013', format='%d.%m.%Y')
  
  as.Date(37, origin='2013-01-01')
#+end_src

*** Secuencias temporales con =Date=
#+begin_src R 
  seq(as.Date('2004-01-01'), by='day', length=10)
  seq(as.Date('2004-01-01'), by='month', length=10)
  seq(as.Date('2004-01-01'), by='10 day', length=10)
#+end_src

*** POSIXct
#+begin_src R 
  as.POSIXct('2013-02-06')
  ISOdate(2013, 2, 7)
#+end_src

#+begin_src R 
hoy <- as.POSIXct('2013-02-06')

help(format.POSIXct)
format(hoy, '%Y')
format(hoy, '%d')
format(hoy, '%m')
format(hoy, '%b')
format(hoy, '%d de %B de %Y')
#+end_src

#+begin_src R 
  hora <- Sys.time()
  hora
  
  format(hora, '%H:%M:%S')
  format(hora, '%H horas, %M minutos y %S segundos')
#+end_src

*** Secuencias temporales con =POSIXct=
#+begin_src R 
seq(as.POSIXct('2004-01-01'), by='month', length=10)
seq(as.POSIXct('2004-01-01 10:00:00'), by='15 min', length=10)
#+end_src

*** Zonas horarias

#+begin_src R 
  as.POSIXct('2013-02-06 15:30:00', tz='GMT')
  as.POSIXct('2013-02-06 15:30:00', tz='Europe/Madrid')
#+end_src

#+begin_src R 
hawaii <- as.POSIXct('2013-02-06 15:30:00', tz='HST')
## Character
format(hawaii, tz='GMT')
## POSIXct
as.POSIXct(format(hawaii, tz='GMT'), tz='GMT')
#+end_src

** Caracteres

*** Bastan unas simples comillas

#+begin_src R 
  cadena <- "Hola mundo"
  class(cadena)
  nchar(cadena)
#+end_src

- Y aquí, ¿qué pasa?
#+begin_src R 
length(cadena)
cadena[1]
cadena[2]
#+end_src

*** Un vector de =character=
#+begin_src R 
  cadenaVec <- c("Hola mundo", "Hello world")
  nchar(cadenaVec)
  length(cadenaVec)
#+end_src

*** Para mostrarlos usamos =cat= o =print=

#+begin_src R 
  a = 2
  b = 3
  
  cat('La suma de', a, 'y', b, 'es', a + b)
  
  cat('La suma de', a, 'y', b, 'es', a + b, fill=TRUE)
  
  cat('La suma de', a, 'y', b, 'es', a + b, '\n',
      'La multiplicación de', a, 'por', b, 'es', a*b, '\n')
  
  cat('La suma de', a, 'y', b, 'es', a + b, '\n',
      'La multiplicación de', a, 'por', b, 'es', a*b, fill=15)
#+end_src

*** Los =character= se pueden unir...
- Primero sencillo
#+begin_src R 
  paste('Hello', 'World', sep='_')
  
  paste(cadenaVec)
  paste(cadenaVec, collapse='=')
#+end_src
- Y algo más complicado
#+begin_src R 
  paste('X', 1:5, sep='.')
  paste(c('A', 'B'), 1:5, sep='.')
  
  paste(c('A', 'B'), 1:5, sep='.', collapse='|')
#+end_src

*** ... y también se pueden separar...
#+begin_src R 
  strsplit(cadenaVec, split=' ')
  strsplit(cadenaVec, split='')
#+end_src

#+begin_src R 
  chSep <- strsplit(cadenaVec, split=' ')
  class(chSep)
  length(chSep)
  sapply(chSep, length)
  sapply(chSep, nchar)
#+end_src

*** ... y, por supuesto, manipular
#+begin_src R 
  sub('o', '0', 'Hola Mundo')
  gsub('o', '0', 'Hola Mundo')
  
  substring(cadena, 1) <- 'HOLA'
  cadena
  
  tolower(cadena)
  toupper(cadena)
#+end_src



* Bucles y condiciones
** Bucles =for=
*** =for=
#+begin_src R 
  for(n in c(2,5,10,20,50)) {
      x <- rnorm(n)
      cat(n,":", sum(x^2),"\n")
  }
  
#+end_src
** Condiciones con =if=, =else= e =ifelse=
*** =if=
#+begin_src R 
  x <- rnorm(10)
  x2 <- numeric(length(x))
  for (i in seq_along(x2)){
      if (x[i]<0) x2[i] <- 0 else x2[i] <- 1
      }
  cbind(x, x2)
#+end_src
*** =ifelse=
#+begin_src R 
  x <- rnorm(10)
  ifelse(x>0, 1, 0)
#+end_src
