intro.tex
\begin{frame}[fragile]
\frametitle{Los \texttt{factor} se pueden generar a partir de variables numéricas}
\label{sec-5-1-5}

\begin{itemize}
\item Por ejemplo, con \texttt{cut}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
gEdad <- cut(edad, breaks=4)
class(gEdad)
levels(gEdad)
nlevels(gEdad)
\end{lstlisting}

\begin{itemize}
\item Nuevamente \texttt{table}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
table(gEdad)
table(gEdad, sexo)
\end{lstlisting}
\end{frame}
\subsection{Fechas}
\label{sec-5-2}
\begin{frame}[fragile]
\frametitle{\texttt{Date}}
\label{sec-5-2-1}


\lstset{language=R}
\begin{lstlisting}
as.Date('2013-02-06')
as.Date('2013/02/06')

as.Date('06.02.2013')
as.Date('06.02.2013', format='%d.%m.%Y')

as.Date(37, origin='2013-01-01')
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Secuencias temporales con \texttt{Date}}
\label{sec-5-2-2}


\lstset{language=R}
\begin{lstlisting}
seq(as.Date('2004-01-01'), by='day', length=10)
seq(as.Date('2004-01-01'), by='month', length=10)
seq(as.Date('2004-01-01'), by='10 day', length=10)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{POSIXct}
\label{sec-5-2-3}


\lstset{language=R}
\begin{lstlisting}
as.POSIXct('2013-02-06')
ISOdate(2013, 2, 7)
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
hoy <- as.POSIXct('2013-02-06')

help(format.POSIXct)
format(hoy, '%Y')
format(hoy, '%d')
format(hoy, '%m')
format(hoy, '%b')
format(hoy, '%d de %B de %Y')
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
hora <- Sys.time()
hora

format(hora, '%H:%M:%S')
format(hora, '%H horas, %M minutos y %S segundos')
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Secuencias temporales con \texttt{POSIXct}}
\label{sec-5-2-4}


\lstset{language=R}
\begin{lstlisting}
seq(as.POSIXct('2004-01-01'), by='month', length=10)
seq(as.POSIXct('2004-01-01 10:00:00'), by='15 min', length=10)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Zonas horarias}
\label{sec-5-2-5}



\lstset{language=R}
\begin{lstlisting}
as.POSIXct('2013-02-06 15:30:00', tz='GMT')
as.POSIXct('2013-02-06 15:30:00', tz='Europe/Madrid')
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
hawaii <- as.POSIXct('2013-02-06 15:30:00', tz='HST')
## Character
format(hawaii, tz='GMT')
## POSIXct
as.POSIXct(format(hawaii, tz='GMT'), tz='GMT')
\end{lstlisting}
\end{frame}
\subsection{Caracteres}
\label{sec-5-3}
\begin{frame}[fragile]
\frametitle{Bastan unas simples comillas}
\label{sec-5-3-1}



\lstset{language=R}
\begin{lstlisting}
cadena <- "Hola mundo"
class(cadena)
nchar(cadena)
\end{lstlisting}

\begin{itemize}
\item Y aquí, ¿qué pasa?
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
length(cadena)
cadena[1]
cadena[2]
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Un vector de \texttt{character}}
\label{sec-5-3-2}


\lstset{language=R}
\begin{lstlisting}
cadenaVec <- c("Hola mundo", "Hello world")
nchar(cadenaVec)
length(cadenaVec)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Para mostrarlos usamos \texttt{cat} o \texttt{print}}
\label{sec-5-3-3}



\lstset{language=R}
\begin{lstlisting}
a = 2
b = 3

cat('La suma de', a, 'y', b, 'es', a + b)

cat('La suma de', a, 'y', b, 'es', a + b, fill=TRUE)

cat('La suma de', a, 'y', b, 'es', a + b, '\n',
    'La multiplicación de', a, 'por', b, 'es', a*b, '\n')

cat('La suma de', a, 'y', b, 'es', a + b, '\n',
    'La multiplicación de', a, 'por', b, 'es', a*b, fill=15)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Los \texttt{character} se pueden unir\ldots{}}
\label{sec-5-3-4}

\begin{itemize}
\item Primero sencillo
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
paste('Hello', 'World', sep='_')

paste(cadenaVec)
paste(cadenaVec, collapse='=')
\end{lstlisting}
\begin{itemize}
\item Y algo más complicado
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
paste('X', 1:5, sep='.')
paste(c('A', 'B'), 1:5, sep='.')

paste(c('A', 'B'), 1:5, sep='.', collapse='|')
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{\ldots{} y también se pueden separar\ldots{}}
\label{sec-5-3-5}


\lstset{language=R}
\begin{lstlisting}
strsplit(cadenaVec, split=' ')
strsplit(cadenaVec, split='')
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
chSep <- strsplit(cadenaVec, split=' ')
class(chSep)
length(chSep)
sapply(chSep, length)
sapply(chSep, nchar)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{\ldots{} y, por supuesto, manipular}
\label{sec-5-3-6}


\lstset{language=R}
\begin{lstlisting}
sub('o', '0', 'Hola Mundo')
gsub('o', '0', 'Hola Mundo')

substring(cadena, 1) <- 'HOLA'
cadena

tolower(cadena)
toupper(cadena)
\end{lstlisting}
\end{frame}
\section{Bucles y condiciones}
\label{sec-6}
\subsection{Bucles \texttt{for}}
\label{sec-6-1}
\begin{frame}[fragile]
\frametitle{\texttt{for}}
\label{sec-6-1-1}


\lstset{language=R}
\begin{lstlisting}
for(n in c(2,5,10,20,50)) {
    x <- rnorm(n)
    cat(n,":", sum(x^2),"\n")
}
\end{lstlisting}
\end{frame}
\subsection{Condiciones con \texttt{if}, \texttt{else} e \texttt{ifelse}}
\label{sec-6-2}
\begin{frame}[fragile]
\frametitle{\texttt{if}}
\label{sec-6-2-1}


\lstset{language=R}
\begin{lstlisting}
x <- rnorm(10)
x2 <- numeric(length(x))
for (i in seq_along(x2)){
    if (x[i]<0) x2[i] <- 0 else x2[i] <- 1
    }
cbind(x, x2)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{\texttt{ifelse}}
\label{sec-6-2-2}


\lstset{language=R}
\begin{lstlisting}
x <- rnorm(10)
ifelse(x>0, 1, 0)
\end{lstlisting}
\end{frame}

\end{document}